kauailabs/navxmxp/stm32/MPU9250/mpucontroller.cpp
/* ============================================
navX MXP source code is placed under the MIT license
Copyright (c) 2015 Kauai Labs

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in
all copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
THE SOFTWARE.
===============================================
*/

#include "mpucontroller.h"
#include "stm32_shim.h"
#include "usb_serial.h"
#include <math.h>
#include "helper_3dmath.h"

extern "C" {
#include "mpl.h"
#include "inv_mpu.h"
#include "inv_mpu_dmp_motion_driver.h"
#include "invensense.h"
#include "mltypes.h"
#include "invensense_adv.h"
#include "eMPL_outputs.h"
#include "stm32f4xx_hal.h"
}
#include <stdio.h>
#define PEDO_READ_MS    (1000)

#define ACCEL_ON        (0x01)
#define GYRO_ON         (0x02)
#define COMPASS_ON      (0x04)

extern I2C_HandleTypeDef hi2c2;

int _MLPrintLog(int priority, const char *tag, const char *fmt, ...) { return 0; }

/******************************************************
 * DMP
 *****************************************************/

struct hal_s {
    unsigned char lp_accel_mode;
    unsigned char sensors;
    unsigned char dmp_on;
    unsigned char wait_for_tap;
    volatile unsigned char new_gyro;
    unsigned char motion_int_mode;
    unsigned long no_dmp_hz;
    unsigned long next_pedo_ms;
    unsigned long next_temp_ms;
    unsigned long next_compass_ms;
    unsigned int report;
    unsigned short dmp_features;
};
static struct hal_s hal = {0};
struct mag_calibration_data magcaldata;

/* Platform-specific information. Kinda like a boardfile. */
struct platform_data_s {
    signed char orientation[9];
};

/* The sensors can be mounted onto the board in any orientation. The mounting
 * matrix seen below tells the MPL how to rotate the raw data from the
 * driver(s).
 */

/* 'Logical' Axes Orientation - As viewed by navX MXP Users.         */
/* This is often referred to as the "World" reference frame.         */

#define MPU_LOGICAL_AXIS_X	0   // PITCH: Increases as 'right' lifts
#define MPU_LOGICAL_AXIS_Y	1	// ROLL:  Increases as 'front' lifts
#define MPU_LOGICAL_AXIS_Z	2	// YAW:   Increases as rotates clockwise

#define NUM_LOGICAL_AXES	3

/* Defines the transform from mpu axes to board axes orientation */

static struct platform_data_s mpu_to_board_orientation_matrices[NUM_LOGICAL_AXES * 2] = {
	// MPU_X_AXIS_DOWN_YAW
	{  0, -1,  0,   // x = chip y (inverted)
	   0,  0,  1,   // y = chip z
      -1,  0,  0},  // z = chip x (inverted)
    // MPU_Y_AXIS_DOWN_YAW
	{ -1,  0,  0,   // x = chip x (inverted)
	   0,  0, -1,   // y = chip z (inverted)
       0, -1,  0},  // z = chip y (inverted)
	// MPU_Z_AXIS_DOWN_YAW
	{ -1,  0,  0,   // x = chip x (inverted)
       0,  1,  0,   // y = chip y
       0,  0, -1},  // z = chip z (inverted)
    // MPU_X_AXIS_UP_YAW
	{  0, -1,  0,   // x = chip y (inverted)
	   0,  0, -1,   // y = chip z (inverted)
       1,  0,  0},  // z = chip x
    // MPU_Y_AXIS_UP_YAW
	{  1,  0,  0,   // x = chip x
	   0,  0, -1,   // y = chip z (inverted)
       0,  1,  0},  // z = chip y
    // MPU_Z_AXIS_UP_YAW
	{  1,  0,  0,   // x = chip x
       0,  1,  0,   // y = chip y
       0,  0,  1},  // z = chip z
};

const int default_mpu_yaw_axis = MPU_LOGICAL_AXIS_Z;
const bool default_mpu_yaw_axis_up = true;

uint8_t curr_mpu_yaw_axis = default_mpu_yaw_axis;
bool curr_mpu_yaw_axis_up = default_mpu_yaw_axis_up;
struct platform_data_s curr_mpu_to_board_orientation_matrix;

_EXTERN_ATTRIB int set_current_mpu_to_board_xform(uint8_t yaw_axis, bool up) {
	platform_data_s *p_selected = 0;
	int status = -1;
	unsigned short gyro_fsr;
	unsigned char accel_fsr;
	if ( yaw_axis > (NUM_LOGICAL_AXES-1) ) return status;
	size_t index = yaw_axis;
	if ( up ) {
		index += NUM_LOGICAL_AXES;
	}
	curr_mpu_yaw_axis = yaw_axis;
	p_selected = &(mpu_to_board_orientation_matrices[index]);
	memcpy(&curr_mpu_to_board_orientation_matrix, p_selected, sizeof(platform_data_s));
    mpu_get_gyro_fsr(&gyro_fsr);
    mpu_get_accel_fsr(&accel_fsr);
    inv_set_gyro_orientation_and_scale(
            inv_orientation_matrix_to_scalar(curr_mpu_to_board_orientation_matrix.orientation),
            (long)gyro_fsr<<15);
    inv_set_accel_orientation_and_scale(
            inv_orientation_matrix_to_scalar(curr_mpu_to_board_orientation_matrix.orientation),
            (long)accel_fsr<<15);
    status = dmp_set_orientation(
        inv_orientation_matrix_to_scalar(curr_mpu_to_board_orientation_matrix.orientation));
    return status;
}

void set_default_mpu_to_board_xform() {
	set_current_mpu_to_board_xform(default_mpu_yaw_axis, default_mpu_yaw_axis_up);
}

/* Defines the transform from compass axes to mpu axes orientation */

static struct platform_data_s compass_to_mpu_orientation_matrix = {
    {  0,  1,  0, // x = chip y
       1,  0,  0, // y = chip x
       0,  0, -1} // z = chip z (inverted)
};

void xform_compass_to_mpu_coordinates( short raw_compass_data[3] ) {
	short raw_compass_data_copy[3];
	for ( int i = 0; i < 3; i++ ) {
		raw_compass_data_copy[i] = raw_compass_data[i];
	}
	for ( int i = 0; i < 3; i++ ) {
		raw_compass_data[i] = 0;
		for ( int j = 0; j < 3; j++ ) {
			if ( compass_to_mpu_orientation_matrix.orientation[(i*3)+j] != 0 ) {
				raw_compass_data[i] =
						raw_compass_data_copy[j] *
						compass_to_mpu_orientation_matrix.orientation[(i*3)+j];
			}
		}
	}
};

