kauailabs/navxmxp/stm32/MPU9250/mpucontroller.cpp
void xform_mpu_to_board_coordinates( short mpu_coordinate_data[3] ) {
	short mpu_coordinate_data_copy[3];
	for ( int i = 0; i < 3; i++ ) {
		mpu_coordinate_data_copy[i] = mpu_coordinate_data[i];
	}
	for ( int i = 0; i < 3; i++ ) {
		mpu_coordinate_data[i] = 0;
		for ( int j = 0; j < 3; j++ ) {
			if ( curr_mpu_to_board_orientation_matrix.orientation[(i*3)+j] != 0 ) {
				mpu_coordinate_data[i] =
						mpu_coordinate_data_copy[j] *
						curr_mpu_to_board_orientation_matrix.orientation[(i*3)+j];
			}
		}
	}
}

#define COMPASS_ENABLED 1
unsigned char *mpl_key = (unsigned char*)"eMPL 5.1";

static const int16_t default_magcal_bias = 0;
static const float default_magcal_xform = 1.0f;
/* By default, set the norm of the earth's mag field to a small value. */
/* This effectively results in constant disturbance detection, which   */
/* is appropriate since the disturbance detection algorithm cannot     */
/* be trusted until the magnetometer has been calibrated.              */
static const float default_magcal_earth_mag_field_norm = 1.0f;
static const float default_magcal_magdisturbance_ratio = 0.19f; /* Empirically-determined default */

float yaw_at_last_new_compass_heading = 0.0f;
float last_new_compass_heading = 0.0f;
float last_valid_fused_heading = 0.0f;
float yaw_at_last_valid_fused_heading = 0.0f;
float compass_heading_noise_band_degrees = 2.0f;
bool first_valid_fused_heading_detected = false;
int valid_fused_header_count = 0;

_EXTERN_ATTRIB bool is_mag_cal_data_default( struct mag_calibration_data *magcaldata )
{
	bool is_default = true;
	for ( size_t i = 0; i < sizeof(magcaldata->bias)/sizeof(magcaldata->bias[0]); i++ ) {
		if ( magcaldata->bias[i] != default_magcal_bias ) {
			is_default = false;
		}
	}
	for ( int x = 0; x < 3; x++ ) {
		for ( int y = 0; y < 3; y++ ) {
			if ( magcaldata->xform[x][y] != default_magcal_xform ) {
				is_default = false;
			}
		}
	}
	if ( magcaldata->earth_mag_field_norm != default_magcal_earth_mag_field_norm ) {
		is_default = false;
	}
	if ( magcaldata->mag_disturbance_ratio != default_magcal_magdisturbance_ratio ) {
		is_default = false;
	}
	return is_default;
}

_EXTERN_ATTRIB void get_default_mag_cal_data(struct mag_calibration_data *magcaldata)
{
	for ( size_t i = 0; i < sizeof(magcaldata->bias)/sizeof(magcaldata->bias[0]); i++ ) {
		magcaldata->bias[i] = default_magcal_bias;
	}
	for ( int x = 0; x < 3; x++ ) {
		for ( int y = 0; y < 3; y++ ) {
			magcaldata->xform[x][y] = default_magcal_xform;
		}
	}
	magcaldata->earth_mag_field_norm = default_magcal_earth_mag_field_norm;
	magcaldata->mag_disturbance_ratio = default_magcal_magdisturbance_ratio;
}

_EXTERN_ATTRIB void mpu_apply_mag_cal_data(struct mag_calibration_data *caldata) {
	memcpy(&magcaldata,caldata,sizeof(magcaldata));
	/* Reset the fused heading tracking variables */
	last_new_compass_heading = 0.0f;
	last_valid_fused_heading = 0.0f;
	yaw_at_last_valid_fused_heading = 0.0f;
	first_valid_fused_heading_detected = false;
	valid_fused_header_count = 0;
}

_EXTERN_ATTRIB void mpu_get_mag_cal_data(struct mag_calibration_data *caldata) {
	memcpy(caldata, &magcaldata, sizeof(magcaldata));
}

/* Every time new gyro data is available, this function is called in an
 * ISR context. In this example, it sets a flag protecting the FIFO read
 * function.
 */
static void gyro_data_ready_cb(void)
{
    hal.new_gyro = 1;
}

/* This function is invoked by core/driver/stm32L/log_stm32.c */

_EXTERN_ATTRIB void fputchar( char *string)
{
}

static void tap_cb(unsigned char direction, unsigned char count)
{
    switch (direction) {
    case TAP_X_UP:
        break;
    case TAP_X_DOWN:
        break;
    case TAP_Y_UP:
        break;
    case TAP_Y_DOWN:
        break;
    case TAP_Z_UP:
        break;
    case TAP_Z_DOWN:
        break;
    default:
        return;
    }
    return;
}

static void android_orient_cb(unsigned char orientation)
{
	switch (orientation) {
	case ANDROID_ORIENT_PORTRAIT:
        break;
	case ANDROID_ORIENT_LANDSCAPE:
        break;
	case ANDROID_ORIENT_REVERSE_PORTRAIT:
        break;
	case ANDROID_ORIENT_REVERSE_LANDSCAPE:
        break;
	default:
		return;
	}
}

unsigned long timestamp = 0;
unsigned long sensor_timestamp = 0;
unsigned char accel_fsr = 0;

_EXTERN_ATTRIB void mpu_initialize(unsigned short mpu_interrupt_pin)
{
    inv_error_t result;
    unsigned short gyro_rate, gyro_fsr;
     struct int_param_s int_param;

#ifdef COMPASS_ENABLED
    unsigned short compass_fsr;
    get_default_mag_cal_data(&magcaldata);
#endif

    /* Set up gyro.
     * Every function preceded by mpu_ is a driver function and can be found
     * in inv_mpu.h.
     */
    int_param.cb = gyro_data_ready_cb;
    int_param.pin = mpu_interrupt_pin;
    result = mpu_init(&int_param);
    if (result) {
        /* Reset */
    }

    /* If you're not using an MPU9150 AND you're not using DMP features, this
     * function will place all slaves on the primary bus.
     * mpu_set_bypass(1);
     */

    result = inv_init_mpl();
    if (result) {
        /* Reset */
    }

    /* Compute 6-axis and 9-axis quaternions. */
    inv_enable_quaternion();
    /* Update gyro biases when not in motion.
     * WARNING: These algorithms are mutually exclusive.
     */
    inv_enable_fast_nomot();
    /* Update gyro biases when temperature changes. */
    inv_enable_gyro_tc();

#ifndef ENABLE_NAVX_HW_CALIBRATION
    inv_enable_in_use_auto_calibration();
#endif
#ifdef COMPASS_ENABLED
    /* Compass calibration algorithms. */
#endif
    /* If you need to estimate your heading before the compass is calibrated,
     * enable this algorithm. It becomes useless after a good figure-eight is
     * detected, so we'll just leave it out to save memory.
     * inv_enable_heading_from_gyro();
     */

    inv_enable_heading_from_gyro();

    /* Allows use of the MPL APIs in read_from_mpl. */
    inv_enable_eMPL_outputs();

    result = inv_start_mpl();
    if (result == INV_ERROR_NOT_AUTHORIZED) {
        while (1) {
            delay_ms(5000);
        }
    }
    if (result) {
        /* Reset */
    }
    /* Get/set hardware configuration. Start gyro. */
    /* Wake up all sensors. */
#ifdef COMPASS_ENABLED
    mpu_set_sensors(INV_XYZ_GYRO | INV_XYZ_ACCEL | INV_XYZ_COMPASS);
#else
    mpu_set_sensors(INV_XYZ_GYRO | INV_XYZ_ACCEL);
#endif
    /* Push both gyro and accel data into the FIFO. */
    mpu_configure_fifo(INV_XYZ_GYRO | INV_XYZ_ACCEL);
    mpu_set_sample_rate(DEFAULT_MPU_HZ);
#ifdef COMPASS_ENABLED
    /* The compass sampling rate can be less than the gyro/accel sampling rate.
     * Use this function for proper power management.
     */
    mpu_set_compass_sample_rate(1000 / COMPASS_READ_MS);
#endif

    /* Read back configuration in case it was set improperly. */
    mpu_get_sample_rate(&gyro_rate);
    mpu_get_gyro_fsr(&gyro_fsr);
    mpu_get_accel_fsr(&accel_fsr);
#ifdef COMPASS_ENABLED
    mpu_get_compass_fsr(&compass_fsr);
#endif
    /* Sync driver configuration with MPL. */
    /* Sample rate expected in microseconds. */
    inv_set_gyro_sample_rate(1000000L / gyro_rate);
    inv_set_accel_sample_rate(1000000L / gyro_rate);
#ifdef COMPASS_ENABLED
    /* The compass rate is independent of the gyro and accel rates. As long as
     * inv_set_compass_sample_rate is called with the correct value, the 9-axis
     * fusion algorithm's compass correction gain will work properly.
     */
    inv_set_compass_sample_rate(COMPASS_READ_MS * 1000L);
#endif

    /* Initialize HAL state variables. */
#ifdef COMPASS_ENABLED
    hal.sensors = ACCEL_ON | GYRO_ON | COMPASS_ON;
#else
    hal.sensors = ACCEL_ON | GYRO_ON;
#endif
    hal.dmp_on = 0;
    hal.report = 0;
    hal.next_pedo_ms = 0;
    hal.next_compass_ms = 0;
    hal.next_temp_ms = 0;

    /* Compass reads are handled by scheduler. */
    get_ms(&timestamp);

    /* To initialize the DMP:
     * 1. Call dmp_load_motion_driver_firmware(). This pushes the DMP image in
     *    inv_mpu_dmp_motion_driver.h into the MPU memory.
     * 2. Push the gyro and accel orientation matrix to the DMP.
     * 3. Register gesture callbacks. Don't worry, these callbacks won't be
     *    executed unless the corresponding feature is enabled.
     * 4. Call dmp_enable_feature(mask) to enable different features.
     * 5. Call dmp_set_fifo_rate(freq) to select a DMP output rate.
     * 6. Call any feature-specific control functions.
     *
     * To enable the DMP, just call mpu_set_dmp_state(1). This function can
     * be called repeatedly to enable and disable the DMP at runtime.
     *
     * The following is a short summary of the features supported in the DMP
     * image provided in inv_mpu_dmp_motion_driver.c:
     * DMP_FEATURE_LP_QUAT: Generate a gyro-only quaternion on the DMP at
     * 200Hz. Integrating the gyro data at higher rates reduces numerical
     * errors (compared to integration on the MCU at a lower sampling rate).
     * DMP_FEATURE_6X_LP_QUAT: Generate a gyro/accel quaternion on the DMP at
     * 200Hz. Cannot be used in combination with DMP_FEATURE_LP_QUAT.
     * DMP_FEATURE_TAP: Detect taps along the X, Y, and Z axes.
     * DMP_FEATURE_ANDROID_ORIENT: Google's screen rotation algorithm. Triggers
     * an event at the four orientations where the screen should rotate.
     * DMP_FEATURE_GYRO_CAL: Calibrates the gyro data after eight seconds of
     * no motion.
     * DMP_FEATURE_SEND_RAW_ACCEL: Add raw accelerometer data to the FIFO.
     * DMP_FEATURE_SEND_RAW_GYRO: Add raw gyro data to the FIFO.
     * DMP_FEATURE_SEND_CAL_GYRO: Add calibrated gyro data to the FIFO. Cannot
     * be used in combination with DMP_FEATURE_SEND_RAW_GYRO.
     */
    dmp_load_motion_driver_firmware();
    set_current_mpu_to_board_xform(MPU_LOGICAL_AXIS_Z, true);
    dmp_register_tap_cb(tap_cb);
    dmp_register_android_orient_cb(android_orient_cb);

