kauailabs/navxmxp/stm32/MPU9250/mpucontroller.cpp
    /*
     * Known Bug -
     * DMP when enabled will sample sensor data at 200Hz and output to FIFO at the rate
     * specified in the dmp_set_fifo_rate API. The DMP will then sent an interrupt once
     * a sample has been put into the FIFO. Therefore if the dmp_set_fifo_rate is at 25Hz
     * there will be a 25Hz interrupt from the MPU device.
     *
     * There is a known issue in which if you do not enable DMP_FEATURE_TAP
     * then the interrupts will be at 200Hz even if fifo rate
     * is set at a different rate. To avoid this issue include the DMP_FEATURE_TAP
     *
     * DMP sensor fusion works only with gyro at +-2000dps and accel +-2G
     */
    hal.dmp_features = DMP_FEATURE_6X_LP_QUAT | DMP_FEATURE_TAP |
        DMP_FEATURE_ANDROID_ORIENT | DMP_FEATURE_SEND_RAW_ACCEL | DMP_FEATURE_SEND_CAL_GYRO |
        DMP_FEATURE_GYRO_CAL;
    dmp_enable_feature(hal.dmp_features);
    dmp_set_fifo_rate(DEFAULT_MPU_HZ);
    mpu_set_dmp_state(0);
    hal.dmp_on = 0;

    /* Enable Interrupts */
}

_EXTERN_ATTRIB void get_mpu_config(struct mpu_config *pconfig)
{
	dmp_get_fifo_rate(&pconfig->mpu_update_rate);
    mpu_get_gyro_fsr(&pconfig->gyro_fsr);
    mpu_get_accel_fsr(&pconfig->accel_fsr);
}

/* Read all 3 accelerometer axes, whichever axis has the greatest
 * absolute value (~1G) is the axis best suited to be used
 * for orientation.
 *
 * Note that this function has a threshold, meaning that this
 * function will only succeed if (a) the device is still and
 * thus acceleration due to motion is minimal and (b) an axis
 * can be found which is at least X% (80?) of 1G, translating
 * to a maximum allowable angle from vertical.
 */

const uint8_t INVALID_AXIS = 255;

_EXTERN_ATTRIB int sense_current_mpu_yaw_orientation( uint8_t *mpu_yaw_axis, bool* up)
{
	short raw_accel_data[3];
	float accel_data_g[3];
	long raw_accel_data_accumulator[3] = {0,0,0};
	unsigned long sample_timestamp;
	unsigned char accel_fsr;
	unsigned short sample_rate;
	unsigned long sample_period_ms;
	int iteration_count = 10;
	mpu_get_accel_fsr(&accel_fsr);
    mpu_get_sample_rate(&sample_rate);
    sample_period_ms = 1000 / sample_rate;
    unsigned char valid_yaw_axis = INVALID_AXIS;
    bool valid_axis_up = true;

	int curr_iteration = 0;
	while ( curr_iteration < iteration_count ) {
		if(!mpu_get_accel_reg(raw_accel_data, &sample_timestamp)) {
			/* Accumulate acceleration*/
			for ( int i = 0; i < 3; i++) {
				raw_accel_data_accumulator[i] += raw_accel_data[i];
			}
		} else {
			return -1;
		}
		delay_ms(sample_period_ms);
		curr_iteration++;
	}
	/* Compute mean acceleration in each axis */
	for ( int i = 0; i < 3; i++) {
		raw_accel_data[i] = (short)(raw_accel_data_accumulator[i] / iteration_count);
	}
	/* Find the axis, if any, which has a value close to +/- 1g */
	for ( int i = 0; i < 3; i++) {
		accel_data_g[i] = (((float)raw_accel_data[i]) / (32768.0 / accel_fsr));
		if ( ( fabs(accel_data_g[i]) > .8 ) && ( fabs(accel_data_g[i]) < 1.2 ) ) {
			if ( valid_yaw_axis == INVALID_AXIS ) {
				valid_yaw_axis = i;
				valid_axis_up = (accel_data_g[i] > 0);
			} else {
				/* More than on axis at/near 1G.  This is an error. */
				return -1;
			}
		}
	}
	if ( valid_yaw_axis != INVALID_AXIS ) {
		*mpu_yaw_axis = valid_yaw_axis;
		*up = valid_axis_up;
	}
	return (valid_yaw_axis != INVALID_AXIS) ? 0 : -1;
}

_EXTERN_ATTRIB int run_mpu_self_test(struct mpu_selftest_calibration_data *caldata)
{
    int result;
    int i;
    long gyro[3], accel[3];

#if defined (MPU6500) || defined (MPU9250)
    result = mpu_run_6500_self_test(gyro, accel, 0);
#elif defined (MPU6050) || defined (MPU9150)
    result = mpu_run_self_test(gyro, accel);
#endif
    if (result == 0x7) {
        /* Test passed. We can trust the gyro data here, so now we need to update calibrated data*/
        for ( i=0; i < 3; i++ ) {
        	caldata->accel_bias[i] = accel[i];
        	caldata->gyro_bias[i]  = gyro[i];
		}
    	mpu_get_accel_sens(&caldata->accel_sensitivity);
    	mpu_get_gyro_sens(&caldata->gyro_sensitivity);

    }
	return result;
}

_EXTERN_ATTRIB void enable_dmp()
{
	if ( hal.dmp_on ) return;

	unsigned short sample_rate;
	hal.dmp_on = 1;
	/* Preserve current FIFO rate. */
	mpu_get_sample_rate(&sample_rate);
	dmp_set_fifo_rate(sample_rate);
	inv_set_quat_sample_rate(1000000L / sample_rate);
	mpu_set_dmp_state(1);
	MPL_LOGI("DMP enabled.\n");
}
//#define USE_CAL_MPU_REGISTERS
_EXTERN_ATTRIB int mpu_apply_calibration_data(struct mpu_selftest_calibration_data *caldata)
{
	long gyro[3], accel[3];

#ifdef USE_CAL_MPU_REGISTERS
        /*
         * This portion of the code uses the HW offset registers that are in the MPUxxxx devices
         * instead of pushing the cal data to the MPL software library
         * These values must be in h/w units, an w/a 1000dps gyro / 8G accel scale
         */
        unsigned char i = 0;

        for(i = 0; i<3; i++) {
        	gyro[i] = (long)(caldata->gyro_bias[i] * 32.8f); //convert to +-1000dps (2000dps?)
        	gyro[i] = (long)(gyro[i] >> 16);
        	accel[i] = caldata->accel_bias[i];
        	accel[i] *= 4096.f; //convert to +-8G Scott Libert, 11/26/2014: Data sheet says +- 16G! (2G?)
        	accel[i] = accel[i] >> 16;
         }

        //mpu_set_gyro_bias_reg(gyro);

#if defined (MPU6500) || defined (MPU9250)
        mpu_set_accel_bias_6500_reg(accel);
#elif defined (MPU6050) || defined (MPU9150)
        mpu_set_accel_bias_6050_reg(accel);
#endif

#elif defined (USE_CAL_DMP_REGISTERS)
        float sens;
        unsigned short accel_sens;
        mpu_get_gyro_sens(&sens);
        gyro[0] = (long)(caldata->gyro_bias[0] * sens);
        gyro[1] = (long)(caldata->gyro_bias[1] * sens);
        gyro[2] = (long)(caldata->gyro_bias[2] * sens);
        dmp_set_gyro_bias(gyro);
        mpu_get_accel_sens(&accel_sens);
        accel[0] = (long)(caldata->accel_bias[0] *accel_sens);
        accel[1] = (long)(caldata->accel_bias[1] *accel_sens);
        accel[2] = (long)(caldata->accel_bias[2] *accel_sens);
        dmp_set_accel_bias(accel);
#else  /* !USE_CAL_HW_REGISTERS */

        /* Push the calibration biases to the MPL Library. These biases are */
        /* in h/w units, but * 2<<16                                        */

		accel[0] = caldata->accel_bias[0] * caldata->accel_sensitivity;
		accel[1] = caldata->accel_bias[1] * caldata->accel_sensitivity;
		accel[2] = caldata->accel_bias[2] * caldata->accel_sensitivity;
		inv_set_accel_bias(accel, 3);
		gyro[0] = (long) (caldata->gyro_bias[0] * caldata->gyro_sensitivity);
		gyro[1] = (long) (caldata->gyro_bias[1] * caldata->gyro_sensitivity);
		gyro[2] = (long) (caldata->gyro_bias[2] * caldata->gyro_sensitivity);
		inv_set_gyro_bias(gyro, 3);
#endif /* USE_CAL_HW_REGISTERS */
		return 0;
}

