kauailabs/navxmxp/stm32/MPU9250/mpucontroller.cpp
#define PI 3.1415926f
const float radians_to_degrees = 180.0 / M_PI;

_EXTERN_ATTRIB int dmp_data_ready()
{
	return hal.new_gyro;
}

struct FloatVectorStruct {
  float x;
  float y;
  float z;
};

void getEuler(float *data, Quaternion *q) {

    data[0] = atan2(2*q -> x*q -> y - 2*q -> w*q -> z, 2*q -> w*q -> w + 2*q -> x*q -> x - 1);   // psi
    data[1] = -asin(2*q -> x*q -> z + 2*q -> w*q -> y);                              // theta
    data[2] = atan2(2*q -> y*q -> z - 2*q -> w*q -> x, 2*q -> w*q -> w + 2*q -> z*q -> z - 1);   // phi
}

void getGravity(struct FloatVectorStruct *v, Quaternion *q) {

    v -> x = 2 * (q -> x*q -> z - q -> w*q -> y);
    v -> y = 2 * (q -> w*q -> x + q -> y*q -> z);
    v -> z = q -> w*q -> w - q -> x*q -> x - q -> y*q -> y + q -> z*q -> z;
}

void dmpGetYawPitchRoll(float *data, Quaternion *q, struct FloatVectorStruct *gravity) {

    // yaw: (about Z axis)
    data[0] = atan2(2*q -> x*q -> y - 2*q -> w*q -> z, 2*q -> w*q -> w + 2*q -> x*q -> x - 1);
    // pitch: (nose up/down, about Y axis)
    data[1] = atan(gravity -> x / sqrt(gravity -> y*gravity -> y + gravity -> z*gravity -> z));
    // roll: (tilt left/right, about X axis)
    data[2] = atan(gravity -> y / sqrt(gravity -> x*gravity -> x + gravity -> z*gravity -> z));
}

#ifdef COMPASS_ENABLED
    short compass_short[3];
#endif
long last_temperature = 32 * 65535; /* Reasonable default */
long compass_accumulator[3] = {0,0,0};
long compass_accumulator_count = 0;
unsigned long next_compass_ms = 0;
#define COMPASS_SAMPLE_PERIOD_MS ((unsigned long)10)
int new_compass = 0;
int new_temp = 0;
int new_data = 0;

_EXTERN_ATTRIB int periodic_compass_update() {
	short new_compass_data_short[3];
	int ret = 0;
	unsigned long curr_timestamp = HAL_GetTick();

	/* Read compass data if sufficient time has passed. */
	if (curr_timestamp > next_compass_ms) {
		next_compass_ms = curr_timestamp + COMPASS_SAMPLE_PERIOD_MS;

		ret = mpu_get_compass_reg(new_compass_data_short, &curr_timestamp);
		if (!ret) {
			// Xform Compass data from chip to board orientation
			xform_compass_to_mpu_coordinates( new_compass_data_short );
			/* Accumulate Compass Data */
			compass_accumulator[0] += new_compass_data_short[0];
			compass_accumulator[1] += new_compass_data_short[1];
			compass_accumulator[2] += new_compass_data_short[2];
			compass_accumulator_count++;
		}
	}
	return ret;
}

_EXTERN_ATTRIB int get_dmp_data( struct mpu_data *pdata )
{
    short gyro[3], accel_short[3];
    FloatVectorStruct gravity;
    short sensors;
    unsigned char more;
    unsigned long sensor_timestamp;
    long accel[3];
    if ( !hal.new_gyro ) return -1;
    if ( NULL == pdata ) return -1;

    get_ms(&timestamp);

    if (!dmp_read_fifo(gyro, accel_short, pdata->quaternion, &sensor_timestamp, &sensors, &more) ) {

    	/* Read mpu temperature data if sufficient time has passed. */
		if (timestamp > hal.next_temp_ms) {
			hal.next_temp_ms = timestamp + TEMP_READ_MS;
			new_temp = 1;
		}

#ifdef COMPASS_ENABLED
		/* Due to compass noise, average each sample (period = COMPASS_READ_MS) */
		if ((timestamp > hal.next_compass_ms) && !hal.lp_accel_mode &&
			hal.new_gyro && (hal.sensors & COMPASS_ON)) {
			hal.next_compass_ms = timestamp + COMPASS_READ_MS;
			new_compass = 1;
		}
#endif

		if ( !more ) {
			hal.new_gyro = 0;
		}

		if (sensors & INV_XYZ_GYRO) {
			new_data = 1;
			if (new_temp) {
				new_temp = 0;
				mpu_get_temperature(&last_temperature, &sensor_timestamp);
				/* Correct for discrepancy between datasheet and mpu_get_temperature implementation */
				last_temperature -= (14 * 65536);
				pdata->temp_c = last_temperature / 65536.0;
			}
		}
		if (sensors & INV_XYZ_ACCEL) {
			/* Transform raw accelerometer data to board orientation */
			xform_mpu_to_board_coordinates(accel_short);
			accel[0] = (long)accel_short[0];
			accel[1] = (long)accel_short[1];
			accel[2] = (long)accel_short[2];
			new_data = 1;
		}
		if (sensors & INV_WXYZ_QUAT) {
			new_data = 1;
		}

#ifdef COMPASS_ENABLED
		periodic_compass_update();
		if (new_compass && ( compass_accumulator_count > 0 )) {
			long compass[3];
			compass[0] = (compass_accumulator[0] / compass_accumulator_count);
			compass[1] = (compass_accumulator[1] / compass_accumulator_count);
			compass[2] = (compass_accumulator[2] / compass_accumulator_count);

			compass_short[0] = (short)compass[0];
			compass_short[1] = (short)compass[1];
			compass_short[2] = (short)compass[2];
			/* Reset accumulator */
			compass_accumulator_count = 0;
			compass_accumulator[0] = 0;
			compass_accumulator[1] = 0;
			compass_accumulator[2] = 0;

			new_data = 1;
		}
#endif

		if ( new_data ) {
			 //inv_execute_on_data();
			/* This function reads bias-compensated sensor data and sensor
			 * fusion outputs from the MPL. The outputs are formatted as seen
			 * in eMPL_outputs.c. This function only needs to be called at the
			 * rate requested by the host.
			 */
			float ypr[3];
			Quaternion q( (float)(pdata->quaternion[0] >> 16) / 16384.0f,
						  (float)(pdata->quaternion[1] >> 16) / 16384.0f,
						  (float)(pdata->quaternion[2] >> 16) / 16384.0f,
						  (float)(pdata->quaternion[3] >> 16) / 16384.0f);

			getGravity(&gravity, &q);
			dmpGetYawPitchRoll(ypr, &q, &gravity);

			pdata->yaw = ypr[0] * radians_to_degrees;
			pdata->pitch = ypr[1] * radians_to_degrees;
			pdata->roll = ypr[2] * radians_to_degrees;

	        pdata->world_linear_accel[0] = (((float)accel_short[0]) / (32768.0 / accel_fsr)) - gravity.x;
	        pdata->world_linear_accel[1] = (((float)accel_short[1]) / (32768.0 / accel_fsr)) - gravity.y;
	        pdata->world_linear_accel[2] = (((float)accel_short[2]) / (32768.0 / accel_fsr)) - gravity.z;

	        float q1[4];
	        float q2[4];
	        float q_product[4];
	        float q_conjugate[4];
	        float q_final[4];

	        // Calculate world-frame acceleration

	        q1[0] = q.w;
	        q1[1] = q.x;
	        q1[2] = q.y;
	        q1[3] = q.z;

	        q2[0] = 0;
	        q2[1] = pdata->world_linear_accel[0];
	        q2[2] = pdata->world_linear_accel[1];
	        q2[3] = pdata->world_linear_accel[2];

	        // Rotate linear acceleration so that it's relative to the world reference frame

	        // http://www.cprogramming.com/tutorial/3d/quaternions.html
	        // http://www.euclideanspace.com/maths/algebra/realNormedAlgebra/quaternions/transforms/index.htm
	        // http://content.gpwiki.org/index.php/OpenGL:Tutorials:Using_Quaternions_to_represent_rotation
	        // ^ or: http://webcache.googleusercontent.com/search?q=cache:xgJAp3bDNhQJ:content.gpwiki.org/index.php/OpenGL:Tutorials:Using_Quaternions_to_represent_rotation&hl=en&gl=us&strip=1

	        // P_out = q * P_in * conj(q)
	        // - P_out is the output vector
	        // - q is the orientation quaternion
	        // - P_in is the input vector (a*aReal)
	        // - conj(q) is the conjugate of the orientation quaternion (q=[w,x,y,z], q*=[w,-x,-y,-z])

	        // calculate quaternion product
	        // Quaternion multiplication is defined by:
	        //     (Q1 * Q2).w = (w1w2 - x1x2 - y1y2 - z1z2)
	        //     (Q1 * Q2).x = (w1x2 + x1w2 + y1z2 - z1y2)
	        //     (Q1 * Q2).y = (w1y2 - x1z2 + y1w2 + z1x2)
	        //     (Q1 * Q2).z = (w1z2 + x1y2 - y1x2 + z1w2

