kauailabs/navxmxp/stm32/MPU9250/mpucontroller.cpp
	        q_product[0] = q1[0]*q2[0] - q1[1]*q2[1] - q1[2]*q2[2] - q1[3]*q2[3];  // new w
	        q_product[1] = q1[0]*q2[1] + q1[1]*q2[0] + q1[2]*q2[3] - q1[3]*q2[2];  // new x
	        q_product[2] = q1[0]*q2[2] - q1[1]*q2[3] + q1[2]*q2[0] + q1[3]*q2[1];  // new y
	        q_product[3] = q1[0]*q2[3] + q1[1]*q2[2] - q1[2]*q2[1] + q1[3]*q2[0];  // new z

	        q_conjugate[0] = q1[0];
	        q_conjugate[1] = -q1[1];
	        q_conjugate[2] = -q1[2];
	        q_conjugate[3] = -q1[3];

	        q_final[0] = q_product[0]*q_conjugate[0] - q_product[1]*q_conjugate[1] - q_product[2]*q_conjugate[2] - q_product[3]*q_conjugate[3];  // new w
	        q_final[1] = q_product[0]*q_conjugate[1] + q_product[1]*q_conjugate[0] + q_product[2]*q_conjugate[3] - q_product[3]*q_conjugate[2];  // new x
	        q_final[2] = q_product[0]*q_conjugate[2] - q_product[1]*q_conjugate[3] + q_product[2]*q_conjugate[0] + q_product[3]*q_conjugate[1];  // new y
	        q_final[3] = q_product[0]*q_conjugate[3] + q_product[1]*q_conjugate[2] - q_product[2]*q_conjugate[1] + q_product[3]*q_conjugate[0];  // new z

	        /* At this point, linear acceleration is in world frame */

	        pdata->world_linear_accel[0] = q_final[1];
	        pdata->world_linear_accel[1] = q_final[2];
	        pdata->world_linear_accel[2] = q_final[3];

	    	float mag_field[3];

	    	pdata->raw_compass[0] = compass_short[0];
	    	pdata->raw_compass[1] = compass_short[1];
	    	pdata->raw_compass[2] = compass_short[2];

			/* Apply compass calibration biases */
	    	mag_field[0] = pdata->raw_compass[0] - magcaldata.bias[0];
	    	mag_field[1] = pdata->raw_compass[1] - magcaldata.bias[1];
	    	mag_field[2] = pdata->raw_compass[2] - magcaldata.bias[2];

			/* Determine whether the current magnetometer reading differs the norm of the earth's */
	    	/* magnetic field by more than the disturbance ratio.  In this case, a magnetic       */
	    	/* anomaly is declared.                                                               */
			float mag_field_norm = (float)sqrt( ( mag_field[0] * mag_field[0] ) +
					( mag_field[1] * mag_field[1] ) +
					( mag_field[2] * mag_field[2] ) );

			float mag_field_difference_from_norm = fabs(mag_field_norm - magcaldata.earth_mag_field_norm );
			pdata->ratio_of_mag_field_norm = mag_field_difference_from_norm / fabs(magcaldata.earth_mag_field_norm);
			if ( pdata->ratio_of_mag_field_norm > magcaldata.mag_disturbance_ratio ) {
				pdata->magnetic_anomaly_detected = true;
			} else {
				pdata->magnetic_anomaly_detected = false;
			}

			/* Correct for soft iron distortion with the calibration matrix */
	    	pdata->calibrated_compass[0] = 0.0;
	    	pdata->calibrated_compass[1] = 0.0;
	    	pdata->calibrated_compass[2] = 0.0;
			for (int i=0; i<3; ++i)
				for (int j=0; j<3; ++j)
					pdata->calibrated_compass[i] += (magcaldata.xform[i][j] * mag_field[j]);

			/* Stabilize the radius of the sphere by multiplying by the ratio from the norm. */
			pdata->mag_norm_scalar = magcaldata.earth_mag_field_norm/mag_field_norm;
			//apply the current scaler to the calibrated coordinates (global array calibrated_values)
			pdata->calibrated_compass[0] *= pdata->mag_norm_scalar;
			pdata->calibrated_compass[1] *= pdata->mag_norm_scalar;
			pdata->calibrated_compass[2] *= pdata->mag_norm_scalar;

	    	// Correct for when signs are reversed.
	    	//if(heading_radians < 0)
	    	//	heading_radians += 2*PI;

			/* Perform tilt compensation, based upon pitch/roll     */
			/* Note that pitch (X Axis) is inverted here, since the */
			/* sign of the X axis is inverted within the Quaternion */
			/* provided by the MPU.                                 */

            float inverted_pitch = -ypr[1];
            float roll = ypr[2];

            float cos_roll = cos(roll);
            float sin_roll = sin(roll);
            float cos_pitch = cos(inverted_pitch);
            float sin_pitch = sin(inverted_pitch);

	    	/* Transform compass data to board orientation */
			xform_mpu_to_board_coordinates(pdata->calibrated_compass);

            float MAG_X = pdata->calibrated_compass[0] * cos_pitch + pdata->calibrated_compass[2] * sin_pitch;
            float MAG_Y = pdata->calibrated_compass[0] * sin_roll * sin_pitch + pdata->calibrated_compass[1] * cos_roll - pdata->calibrated_compass[2] * sin_roll * cos_pitch;
            float tilt_compensated_heading_radians = atan2(MAG_Y,MAG_X);
	    	pdata->heading = tilt_compensated_heading_radians * radians_to_degrees;

	    	/* If new compass heading differs by more than the yaw delta since the last update, */
	    	/* (adding in a margin for the understood compass noise bandwidth), then declare a  */
	    	/* Magnetic anomaly.                                                                */

	    	bool interpolate_fused_heading = true;
	    	if ( new_compass ) {
	    		float compass_delta = fabs(pdata->heading - last_new_compass_heading);
	    		float yaw_delta = fabs(pdata->yaw - yaw_at_last_new_compass_heading);
	    		if ( first_valid_fused_heading_detected &&
	    		     ( compass_delta > (yaw_delta + compass_heading_noise_band_degrees) ) ) {
	    			pdata->magnetic_anomaly_detected = true;
	    		}

				/* Interpolate the fused heading, deriving it from the compass and gyro    */
				/* data, ignoring the compass heading when magnetic anomalies are detected */
				/* and interpolating values in-between compass heading updates.            */
				/* TODO:  Ignore updates from yaw until gyro has been calibrated?          */
				/* Only declare new compass readings valid if rotation less than the       */
				/* compass noise band has occurred.                                        */

	    		if ( ( !pdata->magnetic_anomaly_detected ) &&
	    		     ( yaw_delta < compass_heading_noise_band_degrees ) ) {
	    			valid_fused_header_count++;
	    			if ( valid_fused_header_count >= 3 ) {
						first_valid_fused_heading_detected = true;
						pdata->fused_heading =
							last_valid_fused_heading = pdata->heading;
							yaw_at_last_valid_fused_heading = pdata->yaw;
						interpolate_fused_heading = false;
	    			}
	    		} else {
	    			valid_fused_header_count = 0;
	    		}
				new_compass = 0;
				yaw_at_last_new_compass_heading = pdata->yaw;
				last_new_compass_heading = pdata->heading;
	    	}

	    	if ( interpolate_fused_heading ) {
	    		/* Interpolate fused heading based upon change in gyro yaw */
	    		pdata->fused_heading = last_valid_fused_heading + (pdata->yaw - yaw_at_last_valid_fused_heading);
	    	}

	        /* Modify compass heading ranges from -180-180 to 0-360 degrees */
	        if ( pdata->heading < 0 ) {
	        	pdata->heading += 360;
	        }
	        /* Fused heading possible ranges are Modify 0 (compass) + -180 [-180] */
	        /* to 360 + 180 (540).  Modify the range to be 0-360 degrees.         */
	        if ( pdata->fused_heading < 0 ) {
	        	pdata->fused_heading += 360;
	        } else if ( pdata->fused_heading > 360 ) {
	        	pdata->fused_heading -= 360;
	        }
			pdata->fused_heading_valid = first_valid_fused_heading_detected;

