kauailabs/navxmxp/stm32/MPU9250/mpucontroller.cpp
	    	pdata->calibrated_gyro_x = gyro[0];
	    	pdata->calibrated_gyro_y = gyro[1];
	    	pdata->calibrated_gyro_z = gyro[2];

	    	pdata->raw_gyro[0] = gyro[0];
	    	pdata->raw_gyro[1] = gyro[1];
	    	pdata->raw_gyro[2] = gyro[2];

	    	pdata->raw_accel[0] = accel_short[0];
	    	pdata->raw_accel[1] = accel_short[1];
	    	pdata->raw_accel[2] = accel_short[2];
		}
		return 0;
	} else {
		/* Error communicating with MPU.  Clear the new data received flag. */
		hal.new_gyro = 0;
		return -1;
	}
}

/* The following #defines were copied from inv_dmp_motion_driver.c */
/* This is a hack, but allows ensure we dont' have to modify the   */
/* source code of the Invensense driver.                           */

#define D_EXT_GYRO_BIAS_X       (61 * 16)			// 12 bytes
#define D_EXT_GYRO_BIAS_Y       (61 * 16) + 4
#define D_EXT_GYRO_BIAS_Z       (61 * 16) + 8

uint8_t last_dmp_gyro_bias[12] = {0,0,0,0,0,0,0,0,0,0,0,0};

_EXTERN_ATTRIB int mpu_did_dmp_gyro_biases_change(struct mpu_dmp_calibration_data *dmpcaldata) {
	uint8_t curr_dmp_gyro_bias[12];
	int gyro_bias_cmp;
	int changed = 0;
	mpu_read_mem(D_EXT_GYRO_BIAS_X,12,curr_dmp_gyro_bias);
	gyro_bias_cmp = memcmp(curr_dmp_gyro_bias,last_dmp_gyro_bias,12);
	if ( gyro_bias_cmp != 0 ) {
		changed = 1;
		memcpy(last_dmp_gyro_bias,curr_dmp_gyro_bias,12);
		for ( int i = 0; i < 3; i++ ) {
			/* Convert from big-endian to little-endian */
			dmpcaldata->gyro_bias_q16[i] = (int32_t)__REV(*((uint32_t *)&(curr_dmp_gyro_bias[i*sizeof(long)])));
		}
		dmpcaldata->mpu_temp_c = last_temperature / 65536.0;
	}
	return changed;
}

_EXTERN_ATTRIB int mpu_apply_dmp_gyro_biases(struct mpu_dmp_calibration_data *dmpcaldata) {
	uint8_t new_dmp_gyro_bias[12];
	for ( int i = 0; i < 3; i++ ) {
		/* Convert from little-endian to big-endian */
		*((uint32_t *)&(new_dmp_gyro_bias[i*sizeof(long)]))	 = __REV((uint32_t)dmpcaldata->gyro_bias_q16[i]);
	}
	mpu_write_mem(D_EXT_GYRO_BIAS_X,12,new_dmp_gyro_bias);
	return 0;
}

_EXTERN_ATTRIB int mpu_set_new_sample_rate( uint8_t new_sample_rate ) {
	long int mpl_rate_us = 1000000L / new_sample_rate;
	if (hal.dmp_on) {
        dmp_set_fifo_rate(new_sample_rate);
        inv_set_quat_sample_rate(mpl_rate_us);
    } else {
        mpu_set_sample_rate(new_sample_rate);
    }
    inv_set_gyro_sample_rate(mpl_rate_us);
    inv_set_accel_sample_rate(mpl_rate_us);
    return 0;
}

_EXTERN_ATTRIB bool mpu_detect()
{
	uint8_t address = 0x68;
	return ( HAL_I2C_IsDeviceReady(&hi2c2, address<<1, 3, 100) == HAL_OK );
}
